2_in_class_documentation/intro_to_python_webscraping.org
#+TITLE: Pre-class Installation Requirements for \\ Intro to Python and Webscraping
#+Author: Robert Vesco
#+LATEX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [letterpaper,10pt,microtype]
#+LaTeX_HEADER:  \usepackage[T1]{fontenc} 
#+LaTeX_HEADER: \usepackage[margin=1in]{geometry}
#+LaTeX_HEADER: \usepackage{droid}
#+Latex_header: \input{preamble.tex}
#+Latex_header: \usepackage{attachfile2}
#+LaTeX_HEADER: \usepackage{setspace}

* Introduction


* How to Share Ipython Notebooks


* How to share your vagrant box


* How to use virtualenv & pip 

Virtualenv allow you to create environments. 

#+BEGIN_SRC sh
  ## run this on the command line
  
  ## assuming you are in your projects folder, create a new folder
  
  mkdir projects1 
  
  cd projects1
  
  ## now create your virtualenv environment
  ## this will create a folder called "env". 
  ## this will house a local version of python. 
  
  virtualenv env 
  
  ## IMPORTANT. 
  ## Now you need to activate your environment. 
  
  source env/bin/activate
  
  ## now you will be using a local version of python instead of your
  ## system's python
  
  ## to deactivate, simply type
  
  deactivate
#+END_SRC

Now once virtualenv is installed, you can start installing modules
locally. 

The program to do this is called pip. New versions of python may come
with it already installed, but older version may require manual 
installation. 

#+BEGIN_SRC sh
  ## again, these should be run on the command line. 
  
  ## first, let's activate your virtual environment, if you haven't 
  ## already
  
  source env/bin/activate
  
  ## first, let's inspect what command are available in pip
  
  pip help
  
  ## from this, we see that there are a number of commands we will 
  ## find useful
  
  pip list # this shows what programs are already installed
  
  pip search numpy # this searches for packages named "numpy"
  
  pip install numpy # this installs the numpy package. 
  
  ## if you have many packages you want to install, you can 
  ## create a requirements list
  
  ## this will create a file with a list of modules to install
  ## you can use your editor of choice to install this. 
  
  echo "numpy\nbeautifulsoup" > requirements.txt
  
  ## this will install all the packages in the text file. 
  ## NOTE: you can specify the versions of module too. Sometimes
  ## this is important. 
  
  pip install -r requirements.txt
  
  ## now let's confirm that they installed correctly
  
  pip list 
  
  ## now if you are done with virtualenv remember to deactivate it
  
  deactivate
  
#+END_SRC


#+BEGIN_SRC python


#+END_SRC


* Testing Diagrams
